SmartSync/app/controllers/homes_controller.rb

  def show
    @home = Home.find(params[:id])
---
SELECT  "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT 1  [["id", 1]]