SmartSync/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "David"], ["last_name", "Uli"], ["password_digest", "$2a$10$MqCEe59dx4Ub0VnzpmuNqemEFiyrpiX0PkDEy59lOBZSv5TLQNBP2"], ["updated_at", "2015-09-10 04:45:35.161518"], ["id", 1]]

  def devices
    @homes = User.find(session[:user_id]).homes
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "homes".* FROM "homes" INNER JOIN "properties" ON "homes"."id" = "properties"."home_id" WHERE "properties"."user_id" = $1  [["user_id", 1]]